; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v7 - type_2 ?v4 - type_1)
 	      (pred_2 ?v8 - object ?v4 - type_1)
	      (pred_4 ?v7 - type_2 ?v1 - type_3)
	      (pred_3 ?v7 - type_2 ?v8 - object ?v1 - type_3))

   (:action op_3
       :parameters  (?v7 - type_2 ?v2 ?v6 - type_1)
       :precondition (and  (pred_1 ?v7 ?v2))
       :effect (and  (pred_1 ?v7 ?v6)
		     (not (pred_1 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_2 ?v3 - object ?v5 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v5) (pred_1 ?v7 ?v5) (pred_4 ?v7 ?v1))
       :effect (and (pred_3 ?v7 ?v3 ?v1)
		    (not (pred_2 ?v3 ?v5)) 
		    (not (pred_4 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_2 ?v3 - object ?v5 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v3 ?v1) (pred_1 ?v7 ?v5))
       :effect (and (pred_2 ?v3 ?v5)
		    (pred_4 ?v7 ?v1)
		    (not (pred_3 ?v7 ?v3 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_04 obj_03 - type_3
obj_06 obj_07 obj_05 obj_01 - type_1
obj_09 obj_08 obj_10 - object)
(:init
(pred_1 obj_02 obj_01)
(pred_4 obj_02 obj_04)
(pred_4 obj_02 obj_03)
(pred_2 obj_09 obj_07)
(pred_2 obj_08 obj_06)
(pred_2 obj_10 obj_06)
)
(:goal
(and
(pred_2 obj_09 obj_01)
(pred_2 obj_08 obj_06)
(pred_2 obj_10 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_02 ?b obj_04))))
)
)

; plan
1. (op_3 obj_02 obj_01 obj_07)
   deleted: (pred_1 obj_02 obj_01)
   added: (pred_1 obj_02 obj_07)
   goals met: 1 of 3
2. (op_1 obj_02 obj_09 obj_07 obj_03)
   deleted: (pred_2 obj_09 obj_07) (pred_4 obj_02 obj_03)
   added: (pred_3 obj_02 obj_09 obj_03)
   goals met: 1 of 3
3. (op_3 obj_02 obj_07 obj_06)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_06)
   goals met: 1 of 3
4. (op_3 obj_02 obj_06 obj_01)
   deleted: (pred_1 obj_02 obj_06)
   added: (pred_1 obj_02 obj_01)
   goals met: 1 of 3
5. (op_2 obj_02 obj_09 obj_01 obj_03)
   deleted: (pred_3 obj_02 obj_09 obj_03)
   added: (pred_2 obj_09 obj_01) (pred_4 obj_02 obj_03)
   goals met: 2 of 3
6. (op_3 obj_02 obj_01 obj_06)
   deleted: (pred_1 obj_02 obj_01)
   added: (pred_1 obj_02 obj_06)
   goals met: 2 of 3
7. (op_1 obj_02 obj_10 obj_06 obj_03)
   deleted: (pred_2 obj_10 obj_06) (pred_4 obj_02 obj_03)
   added: (pred_3 obj_02 obj_10 obj_03)
   goals met: 2 of 3
8. (op_3 obj_02 obj_06 obj_01)
   deleted: (pred_1 obj_02 obj_06)
   added: (pred_1 obj_02 obj_01)
   goals met: 2 of 3
9. (op_2 obj_02 obj_10 obj_01 obj_03)
   deleted: (pred_3 obj_02 obj_10 obj_03)
   added: (pred_2 obj_10 obj_01) (pred_4 obj_02 obj_03)
   goals met: 3 of 3
